Revit 2024 API
GBXMLExportOptions Constructor
 Constructs a new instance of the options used to export a model in gbXML (green-building) format.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public GBXMLExportOptions()
Visual Basic
Public Sub New
Visual C++
public:
GBXMLExportOptions()
See Also
GBXMLExportOptions Class
Autodesk.Revit.DB Namespace